import React from "react";
export default function Services() {
  return (
    <section className="services__section">
      <div className="services-card">
        <div className="services-icon">
          <svg
            width="55"
            height="39"
            viewBox="0 0 55 39"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            className="w-full"
          >
            <path
              d="M20.1647 31.5002C19.5783 35.5991 16.0532 38.7502 11.792 38.7502C7.53083 38.7502 4.00564 35.5991 3.41931 31.5002H0.916992V2.50016C0.916992 1.16549 1.99898 0.0834961 3.33366 0.0834961H37.167C38.5017 0.0834961 39.5837 1.16549 39.5837 2.50016V7.3335H46.8337L54.0837 17.1348V31.5002H49.1648C48.5783 35.5991 45.0531 38.7502 40.792 38.7502C36.5309 38.7502 33.0057 35.5991 32.4192 31.5002H20.1647ZM34.7503 4.91683H5.75033V24.3722C7.28554 22.8055 9.42525 21.8335 11.792 21.8335C15.1661 21.8335 18.0788 23.8091 19.4363 26.6668H33.1476C33.5529 25.8137 34.0969 25.039 34.7503 24.3722V4.91683ZM39.5837 19.4168H49.2503V18.7281L44.3969 12.1668H39.5837V19.4168ZM40.792 33.9168C42.3703 33.9168 43.713 32.9081 44.2106 31.5002C44.3443 31.1222 44.417 30.7155 44.417 30.2918C44.417 28.2899 42.794 26.6668 40.792 26.6668C38.79 26.6668 37.167 28.2899 37.167 30.2918C37.167 30.7155 37.2397 31.1222 37.3734 31.5002C37.871 32.9081 39.2137 33.9168 40.792 33.9168ZM15.417 30.2918C15.417 28.2899 13.794 26.6668 11.792 26.6668C9.78995 26.6668 8.16699 28.2899 8.16699 30.2918C8.16699 30.7155 8.23969 31.1222 8.37326 31.5002C8.87089 32.9081 10.2136 33.9168 11.792 33.9168C13.3703 33.9168 14.7131 32.9081 15.2107 31.5002C15.3443 31.1222 15.417 30.7155 15.417 30.2918Z"
              fill="#8E8E8E"
            />
          </svg>
        </div>
        <div className="services-title">توصيل مجاني</div>
        <div className="services-sub-title">على المنتجات + 55 ر.س</div>
      </div>
      <div className="services-card ">
        <div className="services-icon">
          <svg
            width="42"
            height="30"
            viewBox="0 0 42 30"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            className="w-full"
          >
            <path
              d="M15.6657 22.663L37.8807 0.44809L41.2983 3.86576L15.6657 29.4983L0.286133 14.1189L3.70383 10.7012L15.6657 22.663Z"
              fill="#8E8E8E"
            />
          </svg>
        </div>
        <div className="services-title">خصم 50%</div>
        <div className="services-sub-title ">على المنتجات + 55 ر.س</div>
      </div>
      <div className="col-span-2 services-card md:col-span-1">
        <div className="services-icon">
          <svg
            width="47"
            height="50"
            viewBox="0 0 47 50"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            className="w-full"
          >
            <path
              d="M7.66699 39.5002H12.5003V44.3335H41.5003V5.66683H12.5003V10.5002H7.66699V3.25016C7.66699 1.91549 8.74898 0.833496 10.0837 0.833496H43.917C45.2517 0.833496 46.3337 1.91549 46.3337 3.25016V46.7502C46.3337 48.0849 45.2517 49.1668 43.917 49.1668H10.0837C8.74898 49.1668 7.66699 48.0849 7.66699 46.7502V39.5002ZM12.5003 22.5835H29.417V27.4168H12.5003V34.6668L0.416992 25.0002L12.5003 15.3335V22.5835Z"
              fill="#8E8E8E"
            />
          </svg>
        </div>
        <div className="services-title">استرجاع مجاني</div>
        <div className="services-sub-title">في خلال 45 يوم</div>
      </div>
    </section>
  )
}

